struct PrivacyPolicyModel{
    static let text = """
사부작(이하 회사로 지칭)은 고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다.

사부작은 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.

개인정보취급방침을 개정하는 경우 공지사항(또는 개별공지)을 통하여 공지할 것입니다.

**수집하는 개인정보 항목**

사부작은 이름, 이메일, 나이, 성별, 직무, 관심사, 서비스 이용 기록, 생년월일, 휴대폰 번호 등에 대한 정보를 수집합니다. 서비스를 이용하는 과정에서 방문 일시, 사용 이력, 기기 정보, 접속 로그, IP주소 등이 자동으로 생성 및 수집 될 수 있습니다.

회사는 회원 가입, 구매 등 서비스 제공을 위한 최소한의 범위 내에서 이용자의 동의 하에 개인정보를 수집하며, 수집한 모든 개인정보는 고지한 목적 범위 내에서만 이용됩니다.

1. 회원 가입 시

• 필수 정보 : 이름, 아이디(E-MAIL), 성별, 생년월일, 휴대폰번호, 비밀번호, 닉네임, 지역 정보(위치 정보), 직무, 관심

 2. 기타

• 서비스 이용 과정에서 자동 수집 정보 : 회원ID, IP Address, 방문 일시, 서비스 이용 기록, 불량 이용 기록, 기기 정보, ADID, IDFA, 위치 정보, 회원이 업로드한 사진

• 고객 분쟁 처리 및 상담 진행 시 : 상담 내역, 채팅(대화)내역, 서비스 이용 기록

**개인정보의 수집 및 이용 목적**

1. 회원 관리, 서비스 제공·개선, 신규 서비스 개발, 안전한 서비스 관리 등을 위해 이용합니다. 회원 가입 시 또는 서비스 이용 과정에서 아래와 같이 서비스 제공을 위해 필요한 최소한의 개인정보를 수집하고 있습니다.

• 회원의 식별·확인, 회원 가입 의사 확인, 중복 가입 여부 확인
• 만 14세 미만 여부 확인, 법정 대리인의 동의 처리 확인, 법정 대리인 권리 행사 시 본인 확인
• 관심사 분석, 직무 분석, 이용 성향 분석 등의 통계 분석
• 서비스 개선, 민원 기타 문의 사항 처리, 부정 이용에 대한 조사 및 대응
• 고지 사항 전달, 청구서 등의 발송, 법령상 의무 이행
• 새로운 모임, 플레이스 관련 정보 안내 및 마케팅 활동

2. 개인정보의 추가적인 이용・제공을 하는 예외 사항이 있습니다. 수집 목적과 합리적으로 관련된 범위에서는 법령에 따라 이용자의 동의 없이 개인정보를 이용하거나 제 3자에게 제공할 수 있으며, 이때 ‘당초 수집 목적과 관련성이 있는지, 수집한 정황 또는 처리 관행에 비추어 볼 때 개인정보의 추가적인 이용 또는 제공에 대한 예측 가능성이 있는지, 이용자의 이익을 부당하게 침해하는지, 가명 처리 또는 암호화 등 안정성 확보에 필요한 조치를 하였는지’를 종합적으로 고려합니다.

**개인정보의 보유 및 이용기간**

귀하가 제공한 개인정보는 법령에서 별도로 정하거나 귀하와 별도 합의하는 등의 특별한 사정이 없는 한 회사가 제공하는 서비스를 받는 동안 또는 위에서 정한 목적을 달성할 때까지 회사가 보유ㆍ이용하게 됩니다. 회사는 관련 법령(아래의 경우에 한정되지 않습니다)의 규정에 의하여 보존하여야 하는 기록은 일정 기간 보관 후 파기합니다.

• 계약 또는 청약 철회에 관한 기록: 1년
• 대금 결제 및 재화 등의 공급에 관한 기록: 1년
• 소비자의 불만 또는 분쟁 처리에 관한 기록: 1년
• 서비스 이용 관련 개인정보(로그인 기록): 3개월
• 전자 금융에 관한 기록: 1년
• 신용 정보의 수집, 처리 및 이용 등에 관한 기록: 1년

**개인정보 처리**

회사는 이용자의 개인정보를 다음과 같은 목적으로만 처리합니다.

1. 회원 관리

• 이용자 식별, 가입 의사 확인, 본인 확인, 회원 탈퇴 의사 확인, 불량 회원 부정 이용 방지 등
• 법령 및 회사 이용 약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및 제재, 계정 도용 및 부정 거래 방지, 약관 개정 등의 공지사항 전달, 분쟁 조정을 위한 기록 보존, 민원 처리 등

2. 서비스 개발, 제공 및 향상

• 콘텐츠 등 서비스 제공, 서비스 관련 알림 및 안내, 인구통계학적 분석, 서비스 방문 및 이용기록의 분석, 개인정보 및 관심사에 기반한 이용자 간 관계의 형성, 지인 및 관심사 등에 기반한 맞춤형 서비스 제공 등 신규 서비스 요소의 발굴 및 기존 서비스 개선
• 서비스 이용 기록과 접속 빈도 분석, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 따른 맞춤 서비스 제공 및 광고 게재 등

3. 안전한 이용 환경 구축

• 보안, 프라이버시, 안전 측면에서 이용자가 안심하고 이용할 수 있는 서비스 이용 환경 구축 회사는 이용자로부터 동의 받은 처리 목적이 달성되거나 법령에 따른 보존 기간이 달성 될 때까지 개인정보를 처리 및 보유합니다.

**개인정보의 파기 절차 및 방법**

회사는 원칙적으로 이용자의 개인정보를 회원 탈퇴 시 지체 없이 파기하고 있습니다. 단, 개인정보의 보유 및 이용 기간에 따라 이용자에게 개인정보 보관 기간에 대해 별도의 동의를 얻은 경우, 또는 법령에서 일정 기간 정보 보관 의무를 부과하는 경우에는 해당 기간 동안 개인정보를 안전하게 보관합니다.

• 이용자에게 개인정보 보관 기간에 대해 회원 가입 시 동의를 얻은 경우는 아래와 같습니다.

<부정가입 및 이용 방지>

• 부정 이용자의 가입 인증 휴대 전화번호 또는 ID : 탈퇴일로부터 1년간 보관
• 탈퇴한 이용자의 휴대전화번호(복호화가 불가능한 일방향 암호화(해시처리)) : 탈퇴일로부터 6개월 보관

회원 탈퇴, 서비스 종료, 이용자에게 동의 받은 개인정보 보유 기간의 도래와 같이 개인정보의 수집 및 이용 목적이 달성된 개인정보는 재생이 불가능한 방법으로 파기하고 있습니다. 법령에서 보존 의무를 부과한 정보에 대해서도 해당 기간 경과 후 지체 없이 재생이 불가능한 방법으로 파기합니다.  전자적 파일 형태의 경우 복구 및 재생이 되지 않도록 기술적인 방법을 이용하여 안전하게 삭제하며, 출력물 등은 분쇄하거나 소각하는 방식 등으로 파기합니다.

**개인정보 제 3자 제공**

회사는 계약의 이행을 위하여 최소한의 개인정보만 제공하고 있으며, 개인정보를 제 3자에게 제공해야 하는 경우 사전에 이용자에게 해당 사실을 알리고 동의를 구하도록 하겠습니다. 다만, 다음의 경우는 예외로 하고 있습니다.

• 법령의 규정에 의한 경우
• 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사 기관의 요구가 있는 경우

회사가 제공하는 서비스를 통하여 가입 및 신청 등이 일어난 경우 상담 등 거래 당사자간 원활한 의사소통 및 발송 등 거래 이행을 위하여 관련된 정보를 필요한 범위 내에서 거래 당사자에게 제공합니다.

**개인정보의 처리 위탁**

회사는 서비스 향상을 위해서 아래와 같이 개인정보를 위탁하고 있으며, 관계 법령에 따라 위탁 계약 시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다. 수탁자 및 수탁업무 내용은 아래와 같습니다.

위탁자 위탁 업무

• Google Korea 온라인 광고 안내 및 통제

• Facebook Korea 온라인 광고 안내 및 통제

• Apple Korea 온라인 광고 안내 및 통제

• Naver Cloud Platform 정보 보관 및 시스템 운영

• Amplitude 서비스 이용행태 분석

• Google firebase 서비스 이용 행태 분석

• Google Analytics 서비스 이용 행태 분석

• Google 로그 분석 및 온라인 광고 성과 추적

• Facebook 로그 분석 및 온라인 광고 성과 추적

**이용자 및 법정 대리인의 권리와 그 행사 방법**

이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입 해지를 요청할 수도 있습니다.  이용자 혹은 만 14세 미만 아동의 개인정보 조회, 수정을 위해서는 ‘개인정보 변경’(또는 ‘회원 정보 수정’ 등)을 가입 해지(동의 철회)를 위해서는 “회원 탈퇴”를 클릭 하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다. 혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체없이 조치하겠습니다.  귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까 지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자 에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록 하겠습니다.  사부작은 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 사부작이 수집하는 “개인정보의 보유 및 이용 기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.

**개인정보에 관한 민원 서비스**

회사는 고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다.

• 개인 정보 보호 책임자 소속 및 개인 정보 보호 담당 부서 : 정보 보호팀

• 정보 보호팀 이메일 :

귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 담당 부서로 신고하실 수 있습니다. 회사는 이용자들의 신고 사항에 대해 신속하게 충분한 답변을 드릴 것입니다.

기타 개인정보 침해에 대한 신고나 상담이 필요하신 경우에는 다음 기관에 문의하시기 바랍니다.

1) 개인정보 분쟁조정위원회 : https://www.kopico.go.kr

2) 개인정보침해신고센터 : (국번없이)118 (https://privacy.kisa.or.kr)

3)사이버범죄 신고시스템 : https://ecrm.police.go.kr

이 개인정보 처리방침은 2023년 12월 13일에 개정되었습니다.
"""
}
