struct TermsOfServiceModel{
    static let text = """
**제 1 조 (목적)**

이 약관은 사부작(이하 '회사')이 제공하는  사부작 서비스(이하 '서비스')를 이용하는 서비스 사용자(이하 '회원')와 관련하여 회사와 회원과의 권리, 의무 및 책임사항, 운영수칙, 기타 필요한 사항을 규정함을 목적으로 합니다.

**제 2 조 (정의)**

이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

①"서비스"라 함은 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 회원이 이용할 수 있는 소모임 서비스 및 회사가 추가 개발하거나 다른 회사와 제휴계약 등을 통해 제공되는 일체의 서비스를 의미합니다.

②"회원"이라 함은 회사의 서비스에 접속하여 이 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 고객을 의미합니다.

③"아이디"라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자 또는 문자와 숫자의 조합을 의미합니다.

④"모임"이라 함은 회사의 서비스를 통해 회원이 직접 만든 그룹으로 한 명 이상의 회원들과 모여 자유롭게 관심사를 공유하고 친목을 도모할 수 있도록 회사가 제공하는 서비스를 의미합니다.

⑤"방장"이라 함은 회사가 제공하는 서비스를 통해 모임을 개설한 회원 및 모임의 대표 권한을 양도받은 회원을 의미합니다.

⑥"멤버"라고 하면 모임에 가입되어 있는, 모임의 구성원으로 소속된 회원을 의미합니다.

⑦"게시물"이라 함은 회원이 서비스를 이용함에 있어 서비스에 게시한 모든 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진,  채팅메시지 및 각종 파일과 링크 등을 의미합니다.

**제 3 조 (계정 관련)**

사부작은 모임 서비스 특성 상 실제 휴대전화의 소유주임을 확인하기 위해서 가입 당시 인증 절차를 거치게 됩니다. 또한, 다른 모바일 기기에서 서비스 사용을 연속하기 위해서는 기존에 가입하고 인증했던 휴대전화 번호로 재인증을 해야 합니다. 아래의 경우에는 계정 생성을 승인하지 않을 수 있습니다.

1. 다른 사람의 명의나 휴대전화 번호 등 개인 정보를 이용하여 계정을 생성하려 한 경우
2. 동일인이 다수의 계정을 생성하려 한 경우
3. 계정 생성시 필요한 정보를 입력하지 않거나 허위 정보를 입력한 경우
4. 사부작이 과거에 운영원칙 또는 법률 위반 등의 정당한 사유로 해당 계정을 삭제 또는 징계한 경우
5. 사기 정보 모음 사이트나 정부기관 사이트 등에서 거래 사기 이력이 있는 휴대전화 번호로 확인된 경우

계정은 본인만 이용할 수 있고, 다른 사람에게 이용을 허락하거나 양도할 수 없습니다. 사용자는 계정과 관련된 정보, 즉 프로필 사진이나 닉네임, 직무 등을 수정할 수 있습니다. 휴대폰 번호가 바뀐 경우에는 탈퇴 후 신규로 가입 가능할 수 있습니다.

**제 4 조 (사용시 주의해야 할 점)**

사부작은 사용자가 아래와 같이 잘못된 방법이나 행위로 서비스를 이용할 경우 사용에 대한 제재(이용 정지, 강제 탈퇴 등)를 가할 수 있습니다.

1. 잘못된 방법으로 서비스의 제공을 방해하거나 사부작이 안내하는 방법 이외의 다른 방법을 사용하여 서비스에 접근하는 행위
2. 다른 이용자의 정보를 무단으로 수집, 이용하거나 다른 사람들에게 제공하는 행위
3. 서비스를 영리나 홍보 목적으로 이용하는 행위
4. 음란 정보나 저작권 침해 정보 등 공서양속 및 법령에 위반되는 내용의 정보 등을 발송하거나 게시하는 행위
5. 사부작의 동의 없이 서비스 또는 이에 포함된 소프트웨어의 일부를 복사, 수정, 배포, 판매, 양도, 대여, 담보제공하거나 타인에게 그 이용을 허락하는 행위
6. 소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 서비스를 복제, 분해 또는 모방하거나 기타 변형하는 행위
7. 관련 법령, 사부작의 모든 약관 또는 법령을 준수하지 않는 행위

**제 5 조(개인정보 보호 관련)**

개인정보는 서비스의 원활한 제공을 위하여 사용자가 동의한 목적과 범위 내에서만 이용됩니다. 개인정보 보호 관련 기타 상세한 사항은 서비스를 참고하시기 바랍니다.

**제 6 조 (게시물의 저작권 보호)**

사부작 서비스 사용자가 서비스 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다. 사용자가 서비스 내에 게시하는 게시물은 검색 결과 내지 서비스 및 관련 프로모션, 광고 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 사부작은 저작권법 규정을 준수하며, 사용자는 언제든지 고객센터 또는 운영자 문의 기능을 통해 해당 게시물에 대해 삭제, 검색 결과 제외, 비공개 등의 조치를 요청할 수 있습니다.
위 2항 이외의 방법으로 사용자의 게시물을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 사용자의 동의를 얻어야 합니다.

**제 7 조 (게시물의 관리)**

사용자의 게시물이 "정보통신망법" 및 "저작권법"등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 사부작은 관련법에 따라 조치를 취하여야 합니다.
사부작은 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치(삭제, 노출제한, 게시중단) 등을 취할 수 있습니다.

**제 8 조 (서비스 고지 및 홍보 내용 표시)**

사부작은 서비스 사용자분의 편의를 위해 서비스 이용과 관련된 각종 고지 및 기타 사부작 서비스 홍보를 포함한 다양한 정보를 사부작 서비스에 표시하거나 사용자의 휴대폰 문자, 알림 메시지(Push Notification) 등으로 발송할 수 있으며 서비스 사용자분은 이에 동의합니다. 이 경우 서비스 사용자분의 통신환경 또는 요금구조에 따라 서비스 사용자분이 데이터 요금 등을 부담할 수 있습니다. 한편 서비스 사용자분이 수집에 동의한 서비스 내 활동 정보를 기초로 사부작에게 직접적인 수익이 발생하지 않거나 사부작이 판매하는 상품과 직접적인 관련성이 없는 한도에서 다른 서비스 사용자분 등이 판매하는 상품 또는 서비스에 관한 정보를 위와 같은 방법으로 서비스 사용자분에게 보낼 수 있으며 서비스 사용자분은 이에 동의합니다. 물론 서비스 사용자분은 관련 법령상 필요한 내용을 제외하고 언제든지 이러한 정보에 대한 수신 거절을 할 수 있으며, 이 경우 사부작은 즉시 위와 같은 정보를 보내는 것을 중단합니다.

**제 9 조 (회원의 의무)**

①회원은 온라인ㆍ오프라인을 불문하고 다음 행위를 하여서는 안 됩니다.

1. 타인의 정보도용 및 사칭
2. 허위내용의 등록 및 회사가 게시한 정보의 변경
3. 불법적인 금전 거래, 사기, 기만 등 현행법에 위배되는 행위
4. 다른 회원의 개인정보 및 계정정보를 수집하는 행위
5. 회사의 사전 동의 없이 영리의 목적으로 서비스를 이용하는 행위
6. 외설, 음란, 폭력적이거나 기타 공서양속에 반하는 행동 혹은 내용을 서비스에 게시하는 행위
7. 불건전 교제 조장 혹은 매개하기 위한 목적으로 이용하는 행위
8. 회사 및 제3자에 대한 비방, 명예 훼손, 개인정보 침해, 기타 피해를 주는 행위
9. 회사 및 제3자의 저작권 등 지적재산권에 대한 침해 하는 행위
10. 본인이 아닌 제3자에게 접속권한을 부여하는 등, 계정보안에 위험을 초래하는 행위
11. 홍보를 목적으로 모임 개설을 반복하며 서비스 운영에 지장을 주는 행위
12. 서비스 가입과 탈퇴를 의도적으로 반복하며 서비스를 악의적으로 이용하거나 운영에 지장을 주는 행위
13. 리버스엔지니어링, 디컴파일, 디스어셈블 및 기타 일체의 가공행위를 통하여 서비스를 복제, 분해 또는 모방 기타 변형하는 행위
14. 자동 접속 프로그램 등을 사용하는 등정상적인 용법과 다른 방법으로 서비스를 이용하여 회사의 서버에 부하를 일으켜 회사의 정상적인 서비스를 방해하는 행위
15. 기타 본 항에 준하는 경우나 회사가 판단하기에 운영수칙에 위배되거나 서비스에 위협이 되는 행위

②회원은 관계법, 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 운영수칙을 준수하여야 하며 이를 위반한 회원의 경우 회사는 임의로 회원과의 이용계약을 해지하거나 서비스 이용을 제한할 수 있습니다.

③회원은 본 약관을 위배한 회원이나 모임을 회사 측에 신고할 수 있으며 민형사상급의 처벌 문제를 제외한 본 약관 위배에 대한 서비스 이용 제한 여부와 방법은 회사가 판단합니다.

④회사는 신고 내용에 대한 증거자료를 회원에게 요청할 수 있으며 만약 허위 신고로 판명될 경우, 신고한 회원은 서비스 이용에 제한이 있을 수 있습니다.

⑤회원간의 투명하고 원활한 상호교류를 위하여 가입과 방문을 포함한 기타 모임활동 내역이 공개될 수 있습니다.

⑥회원은 모임에 가입한 순간부터 멤버로 활동이 가능하며 방장이 자체적으로 정한 운영방침에 대한 판단과 책임은 가입한 회원 당사자에게 있습니다.

⑦회원은 모임의 멤버가 된 후 회사가 판단한 일정기간 이상 모임을 방문하지 않은 회원은 모임 활동 의사가 없는 것으로 간주, 모임의 활성화를 위해 해당모임에서 자동탈퇴될 수 있습니다.

**제 10 조 (오프라인 서비스 관련)**

사부작은 사용자의 오프라인 모임활동을 지원하기 위해 모임의 특성상 오프라인으로 진행할 경우,

**제 11 조 (서비스 중단)**

사부작 서비스는 장비의 유지∙보수를 위한 정기 또는 임시 점검 또는 다른 상당한 이유로 서비스의 제공이 일시 중단될 수 있으며, 이때에는 미리 서비스 제공 화면에 공지하겠습니다. 만약, 사부작으로서도 예측할 수 없는 이유로 서비스가 중단된 때에는 상황을 파악하는 즉시 통지하겠습니다.

**제 12 조 (이용계약 해지(서비스 탈퇴))**

사용자가 서비스의 이용을 더 이상 원치 않는 때에는 언제든지 사부작 서비스 내 제공되는 메뉴를 이용하여 서비스 이용 계약의 해지 신청을 할 수 있으며, 사부작은 법령이 정하는 바에 따라 신속히 처리하겠습니다. 이용 계약이 해지되면 법령 및 개인정보처리방침에 따라 사용자 정보를 보유하는 경우를 제외하고는 사용자 정보나 사용자가 작성한 게시물 등 모든 데이터는 삭제됩니다. 다만, 사용자가 작성한 게시물이 제 3자에 의하여 스크랩 또는 다른 공유 기능으로 게시되거나, 사용자가 제 3자의 게시물에 댓글, 채팅 등 게시물을 추가하는 등의 경우에는 다른 이용자의 정상적 서비스 이용을 위하여 필요한 범위 내에서 사부작 서비스 내에 삭제되지 않고 남아 있게 됩니다.

**제 13 조 (책임 제한)**

사부작은 법령상 허용되는 한도 내에서 사부작 서비스와 관련하여 본 약관에 명시되지 않은 어떠한 구체적인 사항에 대한 약정이나 보증을 하지 않습니다. 예를 들어, 사부작은 사부작 서비스에 속한 콘텐츠, 서비스의 특정 기능, 서비스의 이용가능성에 대하여 어떠한 약정이나 보증을 하는 것이 아니며, 사부작 서비스를 있는 그대로 제공할 뿐입니다.

**제 14 조 (손해배상)**

사부작의 과실로 인하여 사용자가 손해를 입게 될 경우 사부작은 법령에 따라 사용자의 손해를 배상하겠습니다. 다만, 사부작은 사부작 서비스에 접속 또는 이용과정에서 발생하는 개인적인 손해, 제3자가 불법적으로 사부작의 서버에 접속하거나 서버를 이용함으로써 발생하는 손해, 제3자가 사부작 서버에 대한 전송 또는 사부작 서버로부터의 전송을 방해함으로써 발생하는 손해, 제3자가 악성 프로그램을 전송 또는 유포함으로써 발생하는 손해, 전송된 데이터의 생략, 누락, 파괴 등으로 발생한 손해, 명예훼손 등 제3자가 사부작 서비스를 이용하는 과정에서 사용자에게 발생시킨 손해에 대하여 책임을 부담하지 않습니다. 또한 사부작은 법률상 허용되는 한도 내에서 간접 손해, 특별 손해, 결과적 손해, 징계적 손해, 및 징벌적 손해에 대한 책임을 부담하지 않습니다.

**제 15 조 (약관수정)**

사부작은 법률이나 사부작 서비스의 변경사항을 반영하기 위한 목적 등으로 본 약관이나 각 사부작서비스 고객센터의 사부작 서비스 이용방법, 해당 안내 및 고지사항을 수정할 수 있습니다. 본 약관이 변경되는 경우 사부작은 변경 사항을 개별 사부작 서비스 초기화면에 게시하며, 변경된 약관은 게시한 날로부터 7일 후부터 효력이 발생합니다.

사부작은 변경된 약관을 게시한 날로부터 효력이 발생되는 날까지 약관변경에 대한 사용자의 의견을 기다리겠습니다. 위 기간이 지나도록 사용자의 의견이 접수되지 않으면, 사용자가 변경된 약관에 따라 서비스를 이용하는 데에 동의하는 것으로 보겠습니다. 사용자가 변경된 약관에 동의하지 않는 경우 변경된 약관의 적용을 받는 해당 서비스의 제공이 더 이상 불가능하게 됩니다.

본 약관은 사부작과 사용자와의 관계에 적용되며, 제 3자의 수익권을 발생시키지 않습니다.

사용자가 본 약관을 준수하지 않은 경우에, 사부작이 즉시 조치를 취하지 않더라도 사부작이 가지고 있는 권리를 포기하는 것이 아니며, 본 약관 중 일부 조항의 집행이 불가능하게 되더라도 다른 조항에는 영향을 미치지 않습니다.

본 약관 또는 사부작 서비스와 관련하여서는 대한민국의 법률이 적용됩니다.

공고일자: 2023년 12월 14일
시행일자: 2023년 12월 20일
"""
}
